{"pages":[{"title":"分类","text":"","link":"/categories/index.html"},{"title":"标签","text":"","link":"/tags/index.html"}],"posts":[{"title":"5G_and_cloud_conference","text":"工作是我们探索认识世界的的窗口，所以，热爱它。 — 一默 5G是什么? 移动通迅技术 能承载的应用场景(新增) 峰值速率 产业 1G 通话 2K bps 移动电话 2G 短信，文字邮件 10K bps 电话，BB机 3G 网络，音乐 3.8M bps 游戏，互联网 4G 1080影片 0.1-1G bps 电子支付，金融 5G 4K影片，VR直播，物理网 1-10G bps 传统行业,万物互联 5G主要特点： 高速度：承载更多的信息量，1G高清视频数据只需要几秒。 低延时：5G在接入网边缘部署计算，处理和存储功能的云计算设备，使核心网控制功能下沉，减少端到端的传输，减少延时。 大容量：手表等无这里指承载终端数量大，5G采用高频率，但高频率的信号波长短，需要使用更多的微基站，微基站能部署在城市的任何位置，反而能连接更多的设备终端，万物互联成为可能。4G 每平方公里只能支持10个设备，容纳设备有限。 缺点嘛，都源于：高频率波，穿透性差 邓小平说：“科技是第一生产力”。每一次技术革命都带了新了经济增长，5G技术会影响未来20年的经济。所以这是兵家必争之地。 视频会议软件5G的普及，疫情的影响，会对视频会议软件产生如何的影响？ 我已经在新闻里多次看到视频会议，教育，甚至视频手术的影子。大胆想象，万物相连，任何一个设备，有屏，就可以时实沟通，共享场景，解决“当下”紧急问题。如此看来，属于未来系列中的基础需求，很有价值。 阶段 技术标准 应用 主要功能 专用网数字电视会议 H.200系列 国际电视会议，需要通过卫星，光纤等专用网格，费用高 无 基于IP网络视频会议 H.264 WebEx,GIPS 电话会议，文档共享，即实聊天 云视频会议 WebRTC ？ 屏幕共享,录音，录制，全终端支持 什么是WebRTCWebRTC 全称 Web Real-Time Communication。，Google开源GIPS后，与其它机构制定了行业标准，组成了WebRTC。 它并不是单一的协议， 包含了音视频采集，编解码，加密、传输，音视频展示等在内的多个协议标准以及一套基于 JavaScript 的 API，开源，免专利费。通过简单易用的 JavaScript API ，在不安装任何插件的情况下，让浏览器拥有了 P2P音视频和数据分享的能力。 WebRTC 的核心组件 音视频引擎：OPUS、VP8 / VP9、H264 传输层协议：底层传输协议为 UDP, 也可TCP 媒体协议：SRTP / SRTCP 数据协议：DTLS / SCTP P2P 内网穿透：STUN / TURN / ICE / Trickle ICE 信令与 SDP 协商：HTTP / WebSocket / SIP、 Offer Answer 模型 总结作为新人，想要了解云视频开发，从WebRTC入手是必经之路。 附思 即然有屏都可共享“当下”，那么有屏且有网的的地方就能由超级管理员实时监控啊。","link":"/2021/10/29/5G-and-cloud-conference/"},{"title":"第一篇：接受当下","text":"2021-10-18 个人快照迟迟不知如何开始写第一篇博文，但在“追求完美就是最大的障碍”的暗示下，写下本篇， 这是一个总结。 朋友圈总是看到很多人幸福的瞬间，对比当下我的状态，很是糟糕，所有我屏蔽了朋友圈。周四，周五濒临失控，打开联系人却不知道找谁，最终找到了常常去寺里做佛事的朋友。我将烦恼通通诉说给了他。他向我推荐了一个up主,安大熊。于是我的书单里多了两项紧急阅读书《重新认识你自己》，《自卑与超越》。我失控了，我的状态生病了，先爱惜自己，放下欲望，我需要慢下来，好好休息，好好运动。先把身体维持在一个较好的水平。 工作最近工作很无心，戒断公司咖啡导致的偏头疼。工作内容不饱和，需要自己安排工作内容。目前晋升无望。目前的下一个计划是打算将并发并行好好梳理并分享。再下一个计算是梳理Cache并分享。 生活九月一本书没看，十月略看了两本书， 《游戏力养育》，《股市真规则》，然则，读书而不实践，等于白读。计划每月做一次资产负债表。 情绪《为何家会伤人》，家最会伤人。我爱我母亲同时也恨她，无时无刻她都在念叨着家人的不好，指责这里做不好，哪里做不好，明明每个人都有自己的分工，都在做份内之事， 如果她不愿意做,我提议可以分给别人出来，可她不，她会说别人做得不好，横加指责，然后接着自己继续做。搞得我很不喜欢这样的“家”。对家人发火，对外人格外亲切。慢慢的我是不是也习得了这样的不良行为。我害怕。","link":"/2021/10/18/accept-yourself/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/10/27/hello-world/"}],"tags":[{"name":"科技","slug":"科技","link":"/tags/%E7%A7%91%E6%8A%80/"},{"name":"总结","slug":"总结","link":"/tags/%E6%80%BB%E7%BB%93/"}],"categories":[{"name":"编程","slug":"programming","link":"/categories/programming/"},{"name":"其它","slug":"其它","link":"/categories/%E5%85%B6%E5%AE%83/"}]}